# pages/4_下載.py
import streamlit as st

from utils.download_stock import update_stocks


# -------------------------
# 股票
# -------------------------

SYMBOLS = [
"4916.TW"
]

SYMBOLS2 = [
'0050.TW', '006208.TW','00878.TW', '1560.TW','2337.TW', '2645.TW', '6187.TWO', "00981A.TW", "4953.TWO",
    '6488.TWO', '5483.TWO', '3532.TW', '6182.TWO', '3037.TW', '8046.TW', '3189.TW', '4958.TW', '6138.TWO', '3317.TWO', '2401.TW', '8261.TW', '2327.TW',

 '2492.TW', '3026.TW', '2408.TW', '2344.TW', '2308.TW', '2301.TW', '6829.TWO', '4916.TW', '8033.TW', '2634.TW', '5371.TWO', '3231.TW', '2317.TW',
 '6669.TW', '1301.TW', '1303.TW', '1326.TW', '6505.TW', '8358.TWO', '8021.TW', '6213.TW', '2383.TW', '6274.TWO', '3481.TW', '3149.TW', '3498.TWO',

 '6789.TW', '2211.TW', '2615.TW', '2609.TW', '4585.TW', '2359.TW', '2330.TW', '3711.TW', '6239.TW', '6257.TW', '2449.TW', '3324.TWO', '3017.TW',
 '3653.TW', '3483.TWO', '2382.TW', '2356.TW', '2376.TW', '2059.TW', '2454.TW', '3443.TW', '3661.TW', '6442.TW', '3081.TWO', '3363.TWO', '4977.TW',
 '6282.TW', '2457.TW', '2345.TW', '5388.TW', '7853.TWO', '3042.TW', '3008.TW', '6770.TW', '2303.TW']

# -------------------------
# 標題
# -------------------------

st.title("📥 下載股票資料")


st.write(
    f"目前股票：{len(SYMBOLS)} 檔"
)


st.write(
    "、".join(
        sorted(SYMBOLS)
    )
)


# -------------------------
# 下載
# -------------------------

if st.button(
    "📥 開始更新股票資料",
    use_container_width=True
):

    update_stocks(
        SYMBOLS
    )

    st.success(
        f"✅ 已完成 {len(SYMBOLS)} 檔股票更新"
    )